#+BEGIN_SRC sql :engine postgresql :exports results :cmdline -h 127.0.0.1 -U fieldkit

SELECT id, name, location FROM fieldkit.station WHERE device_id IN ('\xa30e443b5335353334202020ff184a1e')

#+END_SRC

#+RESULTS:
| id | name             | location                                           |
|----+------------------+----------------------------------------------------|
| 16 | Formal Mayfly 65 | 0101000020E6100000000000402A8D5DC000000080830C4140 |

#+BEGIN_SRC sql :engine postgresql :exports results :cmdline -h 127.0.0.1 -U fieldkit

SELECT time, ST_AsText(location) FROM fieldkit.data_record WHERE provision_id IN (
	SELECT id FROM fieldkit.provision WHERE device_id IN ('\xa30e443b5335353334202020ff184a1e')
)
AND location IS NOT NULL
ORDER BY time desc
LIMIT 100

#+END_SRC

#+RESULTS:
| time                | st_astext                                 |
|---------------------+-------------------------------------------|
| 2066-01-01 04:49:01 | POINT(-118.201446533203 34.1063003540039) |
| 2066-01-01 04:48:01 | POINT(-118.201583862305 34.1064529418945) |
| 2066-01-01 04:47:01 | POINT(-118.201637268066 34.1065139770508) |
| 2066-01-01 04:46:02 | POINT(-118.201545715332 34.1065521240234) |
| 2066-01-01 04:45:01 | POINT(-118.20174407959 34.1067085266113)  |
| 2066-01-01 04:44:01 | POINT(-118.201622009277 34.1065788269043) |
| 2066-01-01 04:43:01 | POINT(-118.201538085938 34.1065330505371) |
| 2066-01-01 04:42:01 | POINT(-118.201728820801 34.1064796447754) |
| 2066-01-01 04:41:00 | POINT(-118.201713562012 34.1065101623535) |
| 2066-01-01 04:40:01 | POINT(-118.201683044434 34.1066474914551) |
| 2066-01-01 04:39:02 | POINT(-118.201652526855 34.1064376831055) |
| 2066-01-01 04:38:01 | POINT(-118.201553344727 34.1065216064453) |
| 2066-01-01 04:37:01 | POINT(-118.201637268066 34.1064796447754) |
| 2066-01-01 04:36:01 | POINT(-118.201820373535 34.106330871582)  |
| 2066-01-01 04:35:01 | POINT(-118.201652526855 34.1064682006836) |
| 2066-01-01 04:34:01 | POINT(-118.20149230957 34.1065292358398)  |
| 2066-01-01 04:33:01 | POINT(-118.201591491699 34.1064414978027) |
| 2066-01-01 04:32:01 | POINT(-118.201622009277 34.1065063476562) |
| 2066-01-01 04:31:01 | POINT(-118.201545715332 34.106502532959)  |
| 2066-01-01 04:30:00 | POINT(-118.201553344727 34.1064758300781) |
| 2066-01-01 04:29:01 | POINT(-118.201553344727 34.1064643859863) |
| 2066-01-01 04:28:01 | POINT(-118.201560974121 34.1064338684082) |
| 2066-01-01 04:27:00 | POINT(-118.201667785645 34.106258392334)  |
| 2066-01-01 04:26:01 | POINT(-118.201461791992 34.1063003540039) |
| 2066-01-01 04:25:00 | POINT(-118.201698303223 34.1065216064453) |
| 2066-01-01 04:24:01 | POINT(-118.201652526855 34.1064834594727) |
| 2066-01-01 04:23:01 | POINT(-118.201644897461 34.1064262390137) |
| 2066-01-01 04:22:00 | POINT(-118.20166015625 34.1065483093262)  |
| 2066-01-01 04:21:01 | POINT(-118.201705932617 34.1067581176758) |
| 2066-01-01 04:20:01 | POINT(-118.201583862305 34.1064949035645) |
| 2066-01-01 04:19:01 | POINT(-118.201599121094 34.1064300537109) |
| 2066-01-01 04:18:00 | POINT(-118.201599121094 34.1065139770508) |
| 2066-01-01 04:17:00 | POINT(-118.201591491699 34.1063003540039) |
| 2066-01-01 04:16:02 | POINT(-118.201622009277 34.1064682006836) |
| 2066-01-01 04:15:01 | POINT(-118.201652526855 34.1064567565918) |
| 2066-01-01 04:14:01 | POINT(-118.201652526855 34.1064262390137) |
| 2066-01-01 04:13:01 | POINT(-118.201652526855 34.1064567565918) |
| 2066-01-01 04:12:01 | POINT(-118.201644897461 34.1064872741699) |
| 2066-01-01 04:11:02 | POINT(-118.201675415039 34.1061859130859) |
| 2066-01-01 04:10:02 | POINT(-118.201591491699 34.1060218811035) |
| 2066-01-01 04:09:01 | POINT(-118.201675415039 34.1063690185547) |
| 2066-01-01 04:08:01 | POINT(-118.201675415039 34.1064987182617) |
| 2066-01-01 04:07:01 | POINT(-118.201591491699 34.1064147949219) |
| 2066-01-01 04:06:01 | POINT(-118.201591491699 34.1063804626465) |
| 2066-01-01 04:05:01 | POINT(-118.201622009277 34.1064414978027) |
| 2066-01-01 04:04:02 | POINT(-118.201591491699 34.1065254211426) |
| 2066-01-01 04:03:01 | POINT(-118.201530456543 34.1065864562988) |
| 2066-01-01 04:02:01 | POINT(-118.201652526855 34.1068458557129) |
| 2066-01-01 04:01:00 | POINT(-118.201568603516 34.1064834594727) |
| 2066-01-01 04:00:01 | POINT(-118.201568603516 34.1065559387207) |
| 2066-01-01 03:59:01 | POINT(-118.201545715332 34.1065559387207) |
| 2066-01-01 03:58:01 | POINT(-118.201446533203 34.1063575744629) |
| 2066-01-01 03:57:01 | POINT(-118.201499938965 34.1063575744629) |
| 2066-01-01 03:56:01 | POINT(-118.201461791992 34.1064338684082) |
| 2066-01-01 03:55:01 | POINT(-118.201477050781 34.1065521240234) |
| 2066-01-01 03:54:02 | POINT(-118.201377868652 34.1065444946289) |
| 2066-01-01 03:53:02 | POINT(-118.201461791992 34.1065788269043) |
| 2066-01-01 03:52:01 | POINT(-118.201469421387 34.1064758300781) |
| 2066-01-01 03:51:01 | POINT(-118.201347351074 34.106616973877)  |
| 2066-01-01 03:50:01 | POINT(-118.201187133789 34.1065635681152) |
| 2066-01-01 03:49:01 | POINT(-118.201118469238 34.1065521240234) |
| 2066-01-01 03:48:01 | POINT(-118.201141357422 34.1065521240234) |
| 2066-01-01 03:47:01 | POINT(-118.201316833496 34.1065711975098) |
| 2066-01-01 03:46:00 | POINT(-118.201293945312 34.1065711975098) |
| 2066-01-01 03:45:01 | POINT(-118.201202392578 34.1066131591797) |
| 2066-01-01 03:44:01 | POINT(-118.201217651367 34.1065635681152) |
| 2066-01-01 03:43:01 | POINT(-118.20149230957 34.1064567565918)  |
| 2066-01-01 03:42:01 | POINT(-118.201416015625 34.1064605712891) |
| 2066-01-01 03:41:00 | POINT(-118.201469421387 34.1064300537109) |
| 2066-01-01 03:40:01 | POINT(-118.201438903809 34.1065292358398) |
| 2066-01-01 03:39:00 | POINT(-118.201431274414 34.1064643859863) |
| 2066-01-01 03:38:01 | POINT(-118.201354980469 34.1064414978027) |
| 2066-01-01 03:37:01 | POINT(-118.201545715332 34.1064186096191) |
| 2066-01-01 03:36:01 | POINT(-118.201591491699 34.1063652038574) |
| 2066-01-01 03:35:01 | POINT(-118.201560974121 34.1064491271973) |
| 2066-01-01 03:34:01 | POINT(-118.201438903809 34.1065406799316) |
| 2066-01-01 03:33:01 | POINT(-118.201393127441 34.1064758300781) |
| 2066-01-01 03:32:01 | POINT(-118.201393127441 34.106502532959)  |
| 2066-01-01 03:31:00 | POINT(-118.20157623291 34.1063079833984)  |
| 2066-01-01 03:30:01 | POINT(-118.201766967773 34.106258392334)  |
| 2066-01-01 03:29:01 | POINT(-118.201164245605 34.1061668395996) |
| 2066-01-01 03:28:01 | POINT(-118.201988220215 34.1065902709961) |
| 2066-01-01 03:27:00 | POINT(-118.28401184082 34.0247840881348)  |
| 2066-01-01 03:26:01 | POINT(-118.28401184082 34.0247840881348)  |
| 2066-01-01 03:25:01 | POINT(-118.28401184082 34.0247840881348)  |
| 2066-01-01 03:24:01 | POINT(-118.28401184082 34.0247840881348)  |
| 2066-01-01 03:23:01 | POINT(-118.28401184082 34.0247840881348)  |
| 2066-01-01 03:22:01 | POINT(-118.28401184082 34.0247840881348)  |
| 2066-01-01 03:21:01 | POINT(-118.28401184082 34.0247840881348)  |
| 2066-01-01 03:20:00 | POINT(-118.28401184082 34.0247840881348)  |
| 2066-01-01 03:19:01 | POINT(-118.28401184082 34.0247840881348)  |
| 2066-01-01 03:18:01 | POINT(-118.28401184082 34.0247840881348)  |
| 2066-01-01 03:17:01 | POINT(-118.28401184082 34.0247840881348)  |
| 2066-01-01 03:16:01 | POINT(-118.28401184082 34.0247840881348)  |
| 2066-01-01 03:15:01 | POINT(-118.28401184082 34.0247840881348)  |
| 2066-01-01 03:14:01 | POINT(-118.28401184082 34.0247840881348)  |
| 2066-01-01 03:13:01 | POINT(-118.28401184082 34.0247840881348)  |
| 2066-01-01 03:12:01 | POINT(-118.28401184082 34.0247840881348)  |
| 2066-01-01 03:11:01 | POINT(-118.28401184082 34.0247840881348)  |
| 2066-01-01 03:10:01 | POINT(-118.28401184082 34.0247840881348)  |

#+BEGIN_SRC sql :engine postgresql :exports results :cmdline -h 127.0.0.1 -U fieldkit

SELECT
    tc.table_schema,
    tc.constraint_name,
    tc.table_name,
    kcu.column_name,
    ccu.table_schema AS foreign_table_schema,
    ccu.table_name AS foreign_table_name,
    ccu.column_name AS foreign_column_name
FROM
    information_schema.table_constraints AS tc
    JOIN information_schema.key_column_usage AS kcu
      ON tc.constraint_name = kcu.constraint_name
      AND tc.table_schema = kcu.table_schema
    JOIN information_schema.constraint_column_usage AS ccu
      ON ccu.constraint_name = tc.constraint_name
      AND ccu.table_schema = tc.table_schema
WHERE tc.constraint_type = 'FOREIGN KEY' AND ccu.table_name='user';

#+END_SRC

#+RESULTS:
| table_schema | constraint_name                    | table_name        | column_name | foreign_table_schema | foreign_table_name | foreign_column_name |
|--------------+------------------------------------+-------------------+-------------+----------------------+--------------------+---------------------|
| fieldkit     | field_note_media_user_id_fkey      | field_note_media  | user_id     | fieldkit             | user               | id                  |
| fieldkit     | field_note_user_id_fkey            | field_note        | user_id     | fieldkit             | user               | id                  |
| fieldkit     | project_follower_follower_id_fkey  | project_follower  | follower_id | fieldkit             | user               | id                  |
| fieldkit     | project_invite_user_id_fkey        | project_invite    | user_id     | fieldkit             | user               | id                  |
| fieldkit     | project_user_user_id_fkey          | project_user      | user_id     | fieldkit             | user               | id                  |
| fieldkit     | refresh_token_user_id_fkey         | refresh_token     | user_id     | fieldkit             | user               | id                  |
| fieldkit     | station_owner_id_fkey              | station           | owner_id    | fieldkit             | user               | id                  |
| fieldkit     | station_ingestion_uploader_id_fkey | station_ingestion | uploader_id | fieldkit             | user               | id                  |
| fieldkit     | recovery_token_user_id_fkey        | recovery_token    | user_id     | fieldkit             | user               | id                  |
| fieldkit     | validation_token_user_id_fkey      | validation_token  | user_id     | fieldkit             | user               | id                  |
| fieldkit     | project_update_author_id_fkey      | project_update    | author_id   | fieldkit             | user               | id                  |

#+BEGIN_SRC sql :engine postgresql :exports results :cmdline -h 127.0.0.1 -U fieldkit

	SELECT * FROM
	(
		SELECT
		*,
		CASE
			WHEN type = 'meta' THEN 0
			ELSE 1
		END AS type_ordered
		FROM fieldkit.ingestion
	) AS q
	ORDER BY q.type_ordered, q.time
	LIMIT 10

#+END_SRC

#+RESULTS:
| id | time                       | upload_id                            | user_id | device_id                                  | generation                                                         | type |   size | url                                                                      | blocks    | flags | attempted                  | completed                  | errors | other_errors | meta_errors | data_errors | total_records | type_ordered |
|----+----------------------------+--------------------------------------+---------+--------------------------------------------+--------------------------------------------------------------------+------+--------+--------------------------------------------------------------------------+-----------+-------+----------------------------+----------------------------+--------+--------------+-------------+-------------+---------------+--------------|
|  1 | 2019-09-27 16:39:42.105403 | 5e05a9f6-edf1-4cfe-8c30-0fc7b7fa8dbd |       2 | \xadd74dc25335353334202020ff18423a         | \x20000000808d002020000000808d0020200000007c8d002020000000648d0020 | meta |  61571 | https://fk-streams.s3.amazonaws.com/5e05a9f6-edf1-4cfe-8c30-0fc7b7fa8dbd | [0,102)   | {}    |                            | 2019-10-10 19:52:42.450028 | f      |              |             |             |               |            0 |
|  3 | 2019-10-01 17:15:29.565248 | 209f96b1-34e3-40b4-9946-d9bdb15fe30e |       6 | \x506c024d5335353334202020ff182138202001   | \x20000000486f002020000000546d0020200000005c8d0020200000005c8d0020 | meta |   5748 | https://fk-streams.s3.amazonaws.com/209f96b1-34e3-40b4-9946-d9bdb15fe30e | [0,16)    | {}    |                            | 2019-10-10 19:52:41.573162 | f      |              |             |             |               |            0 |
|  5 | 2019-10-01 19:58:55.446739 | 29d298fa-c820-4406-99a6-963b6876eb4d |       3 | \x1e138b9bb77fd4683c4c4fa9a64eb95bbd8a7a77 | \x28ddc74980084eb90e2905451029c2bdb40e75b5                         | meta | 112771 | https://fk-streams.s3.amazonaws.com/29d298fa-c820-4406-99a6-963b6876eb4d | [0,361)   | {}    | 2019-10-01 21:41:30.713056 |                            | t      |              |             |             |               |            0 |
|  7 | 2019-10-01 21:10:04.91071  | da5a6c6a-cef2-4d84-806d-07bdf6fe085c |       2 | \xadd74dc25335353334202020ff18423a         | \x20000000688f0020a6e3d614638f836608af1c536b7f24534debefa332e4add9 | meta |  65180 | https://fk-streams.s3.amazonaws.com/da5a6c6a-cef2-4d84-806d-07bdf6fe085c | [0,110)   | {}    |                            | 2019-10-10 19:52:42.821547 | f      |              |             |             |               |            0 |
|  9 | 2019-10-01 21:11:43.660972 | 70abd37f-6306-409c-bf9a-fbc14ab0890d |       2 | \xfb51dcff5335353334202020ff182a38         | \x280f0300f6fc0200ec8d0020348f0020941e0000dc1f0000006e7420ec8d0020 | meta |   6235 | https://fk-streams.s3.amazonaws.com/70abd37f-6306-409c-bf9a-fbc14ab0890d | [0,10)    | {}    |                            | 2019-10-10 19:52:41.673011 | f      |              |             |             |               |            0 |
| 11 | 2019-10-02 02:53:16.999741 | 700e710b-e7fe-4a7b-8c4c-33ef14b468f2 |       3 | \x126182466ae2d03803e7f3a523a14e1327ea814f | \x65cb0e9b08e2a9ede313819a5be293cbf44aa3e2                         | meta | 124111 | https://fk-streams.s3.amazonaws.com/700e710b-e7fe-4a7b-8c4c-33ef14b468f2 | [0,397)   | {}    | 2019-10-02 18:35:32.743676 |                            | t      |              |             |             |               |            0 |
| 12 | 2019-10-02 02:56:55.482738 | 15a6d424-c54d-4384-ba19-dcdd12434288 |       3 | \x126182466ae2d03803e7f3a523a14e1327ea814f | \x65cb0e9b08e2a9ede313819a5be293cbf44aa3e2                         | meta | 124111 | https://fk-streams.s3.amazonaws.com/15a6d424-c54d-4384-ba19-dcdd12434288 | [0,397)   | {}    | 2019-10-02 18:35:32.637558 |                            | t      |              |             |             |               |            0 |
| 13 | 2019-10-02 03:04:19.144774 | fb0e6ea2-a041-4a10-a243-05a3e8bf56e9 |       3 | \x126182466ae2d03803e7f3a523a14e1327ea814f | \x65cb0e9b08e2a9ede313819a5be293cbf44aa3e2                         | meta | 124111 | https://fk-streams.s3.amazonaws.com/fb0e6ea2-a041-4a10-a243-05a3e8bf56e9 | [0,397)   | {}    | 2019-10-02 18:35:32.535012 |                            | t      |              |             |             |               |            0 |
| 15 | 2019-10-02 18:16:44.918591 | b7b3c1ab-41c9-470b-bfed-6e78826f20f3 |       2 | \xadd74dc25335353334202020ff18423a         | \x20000000688f0020a6e3d614638f836608af1c536b7f24534debefa332e4add9 | meta |   3860 | https://fk-streams.s3.amazonaws.com/b7b3c1ab-41c9-470b-bfed-6e78826f20f3 | [110,115) | {}    |                            | 2019-10-10 19:52:41.374236 | f      |              |             |             |               |            0 |
| 17 | 2019-10-02 18:25:16.494224 | ede91a0c-e494-42bf-8950-f4e8492f1510 |       2 | \xfb51dcff5335353334202020ff182a38         | \xc00f03008efd0200ec8d0020348f0020941e0000dc1f00000063616cec8d0020 | meta |    737 | https://fk-streams.s3.amazonaws.com/ede91a0c-e494-42bf-8950-f4e8492f1510 | [10,11)   | {}    |                            | 2019-10-10 19:52:41.133215 | f      |              |             |             |               |            0 |

#+BEGIN_SRC sql :engine postgresql :exports results :cmdline -h 127.0.0.1 -U fieldkit

		SELECT
			s.id AS sensor_id,
			m.module_index,
			s.sensor_index
		FROM fieldkit.module_sensor AS s JOIN
			 fieldkit.station_module AS m ON (s.module_id = m.id)
		WHERE m.meta_record_id = 40868
		ORDER BY m.module_index, s.sensor_index

#+END_SRC

#+RESULTS:
| sensor_id | module_index | sensor_index |
|-----------+--------------+--------------|
|       148 |            0 |            0 |
|       149 |            0 |            1 |
|       150 |            0 |            2 |
|       151 |            0 |            3 |
|       152 |            0 |            4 |
|       153 |            0 |            5 |
|       154 |            0 |            6 |
|       155 |            0 |            7 |
|       156 |            0 |            8 |
|       157 |            1 |            0 |
|       158 |            2 |            0 |
|       159 |            2 |            1 |
|       160 |            2 |            2 |
|       161 |            2 |            3 |
|       162 |            3 |            0 |

#+BEGIN_SRC sql :engine postgresql :exports results :cmdline -h 127.0.0.1 -U fieldkit

CREATE OR REPLACE VIEW fieldkit.project_and_station_activity AS
	SELECT sa.created_at, ps.project_id, sa.station_id, sa.id AS station_activity_id, NULL AS project_activity_id FROM
			fieldkit.project_station AS ps
	   JOIN fieldkit.station_activity AS sa ON (ps.station_id = sa.station_id)
	UNION
	SELECT pa.created_at, pa.project_id, NULL, NULL, pa.id AS project_activity_id FROM
		   fieldkit.project_activity AS pa;

SELECT * FROM fieldkit.project_and_station_activity;

#+END_SRC

#+RESULTS:
| CREATE VIEW                |            |            |                     |                     |
|----------------------------+------------+------------+---------------------+---------------------|
| created_at                 | project_id | station_id | station_activity_id | project_activity_id |
| 2020-04-24 17:42:51.568139 |          1 |          1 |                   1 |                     |
| 2020-04-24 17:42:51.575901 |          1 |          1 |                   2 |                     |
| 2020-04-24 17:50:31.004445 |          1 |            |                     |                   1 |

#+BEGIN_SRC sql :engine postgresql :exports results :cmdline -h 127.0.0.1 -U fieldkit

insert into fieldkit.project_station (project_id, station_id) values (1, 1) on conflict do nothing;
insert into fieldkit.project_update  (created_at, project_id, author_id, body) values (now(), 1, 2, 'Hello!');
insert into fieldkit.station_ingestion (created_at, station_id, uploader_id, data_ingestion_id, data_records, errors) values (now(), 1, 2, 15, 100, false);
insert into fieldkit.station_deployed  (created_at, station_id, deployed_at, location) values (now(), 1, now(), st_setsrid(st_point(-71.104, 42.315), 4326));
/*
insert into fieldkit.project_station_activity (created_at, project_id, station_activity_id) values ('2020-04-22 18:51:56.583585', 1, 1);
insert into fieldkit.project_station_activity (created_at, project_id, station_activity_id) values ('2020-04-22 18:51:56.583585', 1, 2);
*/

#+END_SRC

#+RESULTS:
| INSERT 0 1 |
|------------|
| INSERT 0 1 |
| INSERT 0 1 |
| INSERT 0 1 |

#+BEGIN_SRC sql :engine postgresql :exports results :cmdline -h 127.0.0.1 -U fieldkit

SELECT *
         FROM fieldkit.station_activity AS a
	LEFT JOIN fieldkit.station_deployed AS sd ON (a.id = sd.id)
	LEFT JOIN fieldkit.station_ingestion AS si ON (a.id = si.id)
	ORDER BY a.created DESC

#+END_SRC

#+RESULTS:

#+BEGIN_SRC sql :engine postgresql :exports results :cmdline -h 127.0.0.1 -U fieldkit

SELECT u.id AS user_id, u.name AS user, p.id AS project_id, p.name AS project_name
         FROM fieldkit.user AS u
	LEFT JOIN fieldkit.project_user AS pu ON (pu.user_id = u.id)
	LEFT JOIN fieldkit.project AS p ON (p.id = pu.project_id)
	ORDER BY user_id, project_id

#+END_SRC

#+RESULTS:
| user_id | user             | project_id | project_name             |
|---------+------------------+------------+--------------------------|
|       1 | Demo User        |            |                          |
|       2 | Jacob Lewallen   |          7 | Default FieldKit Project |
|       3 | Test User        |            |                          |
|       4 | NewPerson        |            |                          |
|       5 | Shah Selbe       |          8 | Default FieldKit Project |
|       5 | Shah Selbe       |         16 | Moore Demo               |
|       6 | Libbey White     |          5 | FieldKit Project         |
|       6 | Libbey White     |         17 | Snails                   |
|       7 | Felicia Chang    |            |                          |
|       8 | Bradley Gawthrop |            |                          |
|      10 | Tester           |            |                          |
|      14 | Kristi Cervania  |          6 | Default FieldKit Project |
|      15 | Lauren McElroy   |         14 | Default FieldKit Project |
|      16 | Susan Allen      |         10 | Default FieldKit Project |
|      16 | Susan Allen      |         22 | Susan's Test Project     |
|      18 | Kristi-Test      |            |                          |
|      19 | Jer Thorp        |          9 | Default FieldKit Project |
|      20 | Graeme           |         15 | Default FieldKit Project |
|      21 | Ricky            |            |                          |
|      22 | Paulo            |         24 | Default FieldKit Project |
|      25 | Ricky            |            |                          |
|      27 | Libbey           |            |                          |
|      28 | susantest        |            |                          |

#+BEGIN_SRC sql :engine postgresql :exports results :cmdline -h 127.0.0.1 -U fieldkit

SELECT s.id AS station_id, s.name AS station_name, o.id AS owner_id, o.name AS owner, p.id AS project_id, p.name AS project_name
		 FROM fieldkit.station AS s
    LEFT JOIN fieldkit.user AS o ON (s.owner_id = o.id)
	LEFT JOIN fieldkit.project_station AS ps ON (ps.station_id = s.id)
	LEFT JOIN fieldkit.project AS p ON (p.id = ps.project_id)
	 ORDER BY station_id, project_id

#+END_SRC

#+RESULTS:
| station_id | station_name           | owner_id | owner            | project_id | project_name             |
|------------+------------------------+----------+------------------+------------+--------------------------|
|          1 | feldspar               |       10 | Tester           |            |                          |
|          3 | quartz                 |       10 | Tester           |          1 | Demo Project             |
|         13 | Friendly Horse 11      |        2 | Jacob Lewallen   |            |                          |
|         15 | Quiet Catfish 86       |        2 | Jacob Lewallen   |            |                          |
|         16 | Formal Mayfly 65       |        2 | Jacob Lewallen   |            |                          |
|         19 | Stupid Sloth 44        |        2 | Jacob Lewallen   |            |                          |
|        154 | Vibrant Lizard 98      |        6 | Libbey White     |          5 | FieldKit Project         |
|        159 | Admired Goose 81       |        2 | Jacob Lewallen   |            |                          |
|        162 | Green Zebra 85         |        8 | Bradley Gawthrop |            |                          |
|        163 | Tender Dog 79          |        2 | Jacob Lewallen   |            |                          |
|        164 | Breezy Stingray 71     |       15 | Lauren McElroy   |            |                          |
|        165 | Brown Dodo 10          |        5 | Shah Selbe       |            |                          |
|        169 | mica                   |        6 | Libbey White     |         17 | Snails                   |
|        170 | Massive Jellyfish 86   |        2 | Jacob Lewallen   |            |                          |
|        171 | Noteworthy Warthog 54  |        5 | Shah Selbe       |            |                          |
|        172 | Tremendous Stingray 21 |        5 | Shah Selbe       |            |                          |
|        173 | Impressive Hound 101   |       20 | Graeme           |         15 | Default FieldKit Project |
|        174 | Huge Falcon 36         |       16 | Susan Allen      |         10 | Default FieldKit Project |
|        174 | Huge Falcon 36         |       16 | Susan Allen      |         22 | Susan's Test Project     |
|        175 | Pleasant Jellyfish 60  |       15 | Lauren McElroy   |            |                          |
|        176 | Calm Panda 40          |       15 | Lauren McElroy   |            |                          |
|        177 | Bewitched Husky 17     |        5 | Shah Selbe       |          8 | Default FieldKit Project |
|        177 | Bewitched Husky 17     |        5 | Shah Selbe       |         16 | Moore Demo               |
|        178 | Ambitious Stingray 65  |        5 | Shah Selbe       |            |                          |
|        179 | super panda            |       22 | Paulo            |         24 | Default FieldKit Project |
|        180 | Lucky Sloth 2          |        5 | Shah Selbe       |            |                          |
|        181 | Highland Park Selbe    |        5 | Shah Selbe       |            |                          |


#+BEGIN_SRC sql :engine postgresql :exports results :cmdline -h 127.0.0.1 -U fieldkit

UPDATE fieldkit.project SET name = 'Demo Project' WHERE id = 1;
INSERT INTO fieldkit.project_station (project_id, station_id) VALUES (1, 12) ON CONFLICT DO NOTHING;
INSERT INTO fieldkit.project_user (project_id, user_id) VALUES (1, 26) ON CONFLICT DO NOTHING;

#+END_SRC

#+RESULTS:
| UPDATE 1 |
|----------|

#+BEGIN_SRC sql :engine postgresql :exports results :cmdline -h 127.0.0.1 -U fieldkit

SELECT ST_Buffer(ST_GeomFromText('POINT(1 1)'), 10) ~ ST_MakeBox2D(ST_MakePoint(0,0), ST_MakePoint(2,2)) AS contains;

#+END_SRC

#+RESULTS:
| contains |
|----------|
| t        |


#+BEGIN_SRC sql :engine postgresql :exports results :cmdline -h 127.0.0.1 -U fieldkit

SELECT * FROM fieldkit.project_and_station_activity ORDER BY created_at DESC;

		SELECT
			a.id, a.created_at, a.station_id, a.deployed_at, ST_AsBinary(a.location) AS location
		FROM fieldkit.station_deployed AS a
		WHERE a.id IN (

			SELECT station_activity_id FROM fieldkit.project_and_station_activity WHERE (1 IS NULL OR project_id = 1) AND (1 IS NULL OR station_id = 1) ORDER BY created_at DESC

		)

#+END_SRC

#+RESULTS:
| created_at                 |                 project_id | station_id | station_activity_id        | project_activity_id                          |
|----------------------------+----------------------------+------------+----------------------------+----------------------------------------------|
| 2020-04-24 18:04:39.921296 |                          1 |          1 | 2                          |                                              |
| 2020-04-24 18:04:39.916216 |                          1 |          1 | 1                          |                                              |
| 2020-04-24 18:04:39.911111 |                          1 |            |                            | 1                                            |
| id                         |                 created_at | station_id | deployed_at                | location                                     |
| 2                          | 2020-04-24 18:04:39.921296 |          1 | 2020-04-24 18:04:39.921296 | \x01010000002db29defa7c651c0b81e85eb51284540 |
